---
archived: ~
categories: ~
keywords: ~
published: ~
status: ~
title: Уведомления сайта
---

Если вы посетите <https://iconoclasts.blog/>Теперь ваш браузер должен попросить вас включить уведомления.

Что делает это, так это включение уведомлений на вашем ноутбуке, которые сообщают вам всякий раз, когда кто-то вносит изменения в страницы, на которые вы подписаны (также известные как просмотр).

Вы можете просмотреть список доступных уведомлений, введя "уведомление=" в строке поиска в правом верхнем углу панели навигации.

<!-- $Date$ $Author$ -->
