---
archived: ~
categories: ~
dependencies: '*.md.ru'
keywords: ~
published: ~
status: ~
title: Реквием для волонтера с открытым исходным кодом
---

## {# lede #}джимджаг'блог{# lede #}.

Открытый исходный код навсегда изменил технологии. То, что когда-то рассматривалось как эскизный, альтернативный метод лицензирования и разработки программного обеспечения, теперь стало де-факто стандартом. И по мере того, как индустрия программного обеспечения развивалась и росла, сам ИТ-ландшафт был изменен из-за неумолимого движения открытого исходного кода, так же как геология самой Земли была изменена проходом ледников.

Существует множество причин успеха Open Source, и в большинстве случаев эти причины усилились и укоренились. Но одна из жизненно важных сил открытого исходного кода и, возможно, одна из самых важных, видела упадок, почти пугающее уменьшение своего места в пантеоне. Когда-то он почти определил открытый исходный код, он'Сейчас это редкость, на пути к вымиранию. И влияние этого снижения на долгосрочную жизнеспособность открытого исходного кода может быть 1-м опрокидывающим домино, угрожающим разрушить всю структуру. Я говорю о важности волонтера Open Source.

Когда Open Source впервые начал расти, волонтёром стали его митохондрии. Люди работали над этими проектами, потому что у них был личный интерес к ним; в свое свободное время они неустанно работали над улучшением и продвижением проекта. Они были'по большей части, но они наслаждались и процветали в среде, где они могли бы быть хозяевами своей собственной судьбы, и сотрудничать с другими подобными мыслящими людьми в проекте, который они могли бы действительно сказать. "их". Такое окружение тянуло в лучшую и самую яркую, жаждущую свободы работать вместе, чтобы коллективно поцарапать свой собственный зуд, как говорится. Результатом стало то, что эти проекты с открытым исходным кодом вскоре превзошли коммерческих конкурентов из-за плотного цикла обратной связи между пользователем и автором, который включил Open Source. На самом деле, это была одна из негласных целей: побудить пользователей стать Участниками и сделать это как можно проще для этого.

Другими словами: барьеры для входа были низкими, легко управляемыми такими добровольцами, которые помогали и вносили свой вклад в свободное время.

Но по мере того, как Open Source стал более успешным, эта динамика начала меняться, почти незаметно поначалу. Первый этап состоял в том, что такие волонтеры были наняты компаниями, чтобы продолжать работу над теми проектами с открытым исходным кодом, в которых они уже были. Эти компании зависели от этих баз с открытым исходным кодом, и поэтому наем этих людей был просто хорошим бизнесом. Для этих участников оплата за то, что они считали своим хобби, была мечтой. Но возраст платного Open Source Contributor начался.

Вторым большим изменением стало то, что эти проекты с открытым исходным кодом стали все больше и больше. "важно." Было медленное, но устойчивое повышение этой планки, потому что, в конце концов, разрушение такой важной части программного обеспечения может'быть рискованным, но позволять "только кто-либо" внести свой вклад. И по мере того, как корпоративные интересы стали все больше и больше влиять, они начали диктовать условия того, как эти проекты с открытым исходным кодом управлялись и управлялись.

В этот момент волонтеру становилось все труднее и труднее конкурировать. Она конкурирует с людьми, которым платят полный рабочий день за работу над проектом, и с структурой управления, которая требует чрезмерных знаний, опыта и времени, чтобы их вклад даже считался менее вознагражденным. В то время как раньше у такого волонтера был четкий и жизнеспособный путь стать надежным приверженцем, тем, кто на самом деле был основной частью проекта, этот путь был закрыт. Вы были ограничены и ограничены возможностью предоставления Pull-запросов. Но основная часть взносов поступала от наемных работников, чья единственная лояльность была к доллару.

Это продолжалось до такой степени, что мы сейчас находимся на этапе, когда большинство участников с открытым исходным кодом находятся в нем за деньги, и ничего больше. В то время как раньше вы видели, как люди переходят из компании в компанию и продолжают свои усилия в рамках проекта, теперь, если кто-то покидает компанию, их деятельность по этим проектам опускается до нуля. Вместо того, чтобы освобождать компании с открытым исходным кодом, чтобы выбрать правильное программное обеспечение для своих нужд и иметь возможность потенциально помочь повлиять на направление сотрудничества, только глубокие карманные компании теперь имеют эту способность, поддерживаемую фондами, которые являются немного больше, чем фасады для корпоративного контроля. Да, все еще может быть несколько "несогласованный" Но очевидно, что некоторые свиньи более равны, чем другие.

Изменения в динамике поразительны. В настоящее время компании просто спонсируют проекты и фонды с открытым исходным кодом, чтобы эти проекты и фонды могли создавать решения, которые они теперь должны покупать. Они в основном платят за привилегию покупать программное обеспечение и решения. Вместо того, чтобы открывать исходный код, позволяющий компаниям управлять своей судьбой, узурпируется сделать эти компании более ответственными перед поставщиками и поставщиками.

И все это потому, что мы забыли, насколько важно истинное сообщество, на примере волонтера.
<!-- $Date: 2024-11-26 08:19:37 -0700 (Tue, 26 Nov 2024) $ $Author: jimjag $ $Revision: 25444 $ -->
