---
archived: ~
categories: ~
dependencies: '*.md.ru'
keywords: heyoka, иконоборчество
published: ~
status: черновик
title: Случайные мысли Джо
---


<div class="right">

[![Хёка](index.page/heyoka.jpg)](https://en.wikipedia.org/wiki/Heyoka)

</div>

## Добро пожаловать!

{# lede #}Мы практикуем [Открытая наука](triple-products) здесь{# lede #}.

## Обо мне

я'м [ИНТДЖ-А](https://www.16personalities.com/intj-personality) тип человека, который ценит эклектичные, ненормальные, нетипичные аспекты жизни. Я освоил [Вин Чунь](https://www.youtube.com/watch?v=Qexxe6ANG2o) в средней школе, [Физическая математика](https://www.math.stonybrook.edu/~leontak/#:~:text=joseph%20schaefer) в университете, и [Проектирование оптимизации](https://www.linkedin.com/in/joesuf4/) в моей профессиональной карьере.

### Личная жизнь

Женат на самой удивительной женщине на Земле, чья любовь ко мне благословила нас обоих с драгоценной дочерью.  Мы живем в Южной Флориде и совместно управляем моим S-CORP <https://sunstarsys.com>, который предоставляет оборудование и программное обеспечение инфраструктуры для этого сайта.

### Делия Фриз, ко мне

Вы знакомы с ролью Heyók ⁇ a
    Играть в индейской культуре? Ты, мой
    Дорогая, это мой личный Heyók ⁇ a.

![Грок Хейока](index.page/heyoka-grok)

Я создал <https://iconoclasts.blog> для удовлетворения родственных духов онлайн; кто нуждается в общественном, без цензуры, длинная форма эссе сообщество &mdash; чтобы делиться и взаимодействовать друг с другом'Самые политически неудобные, авангардные идеи.

Если это звучит как ты, [пожалуйста, зарегистрируйтесь](/contact)!

<!-- $Date$ $Author$ $Revision$ -->
