---
archived: ~
categories: ~
dependencies: '*.md.ru'
keywords: хейока, иконоборцы
published: ~
status: проверено=25400
title: Случайные мысли Джо
---


<div class="right">

[![Хейока](index.page/heyoka.jpg)](https://en.wikipedia.org/wiki/Heyoka).

</div>

## {# lede #}Добро пожаловать!{# lede #}

Мы практикуем [Открытая наука](triple-products).

## Обо мне

Я - [ИНТЕРВАЛ-А](https://www.16personalities.com/intj-personality) тип человека, который лелеет эклектичные, ненормальные, атипичные аспекты жизни. Я освоил [Вин Чун](https://www.youtube.com/watch?v=Qexxe6ANG2o) в средней школе, [Физическая математика](https://www.math.stonybrook.edu/~leontak/) в университете и [Проектирование оптимизации](https://www.linkedin.com/in/joesuf4/).

### Личная жизнь

Женат на самой удивительной женщине на Земле, чья любовь ко мне благословила нас обоих драгоценной дочерью.  Мы живем в Южной Флориде и совместно управляем моим S-CORP <https://sunstarsys.com>, который предоставляет оборудование и программное обеспечение инфраструктуры для этого сайта.

### Делия освобождает меня

Вы знакомы с ролью Heyók ⁇ a
    играет в индейской культуре? Ты, мой


Я создал <https://iconoclasts.blog> для того, чтобы удовлетворить запросы в Интернете, которые нуждаются в публичном, свободном от цензуры, сообществе написания эссе в длинной форме &mdash;

Если это звучит как ты, [пожалуйста, зарегистрируйтесь](/contact).

<!-- $Date$ $Author$ $Revision$ -->
