---
archived: ~
categories: ~
keywords: ~
published: ~
status: ~
title: ~
---

@article{MS67,
  title={Кривизна и собственные ценности лаплацкого языка},
  journal={Журнал дифференциальной геометрии},
  author={McKean, Генри П. и Сингер, Исадор М.},
  volume={1},
  number={1-2},
  pages={43--69},
  year={1967 год},
  publisher={Университет Лихай}
}
}
@book{JC19,
  author={Конвей, Джон Б.},
  title={Курс по функциональному анализу},
  volume={96},
  year={2019 г.},
  publisher={Спрингер}
}
}
@article{CS92,
 author={Конвей, Джон Х и Слоун, Н. Дж. А.},
 title={Четырехмерные решетки с той же тета-серией},
 journal={Интернат. Математика. Рес. Уведомления},
 volume={4},
 year={1992 год},
 pages={93--96}
}
}
@article{DH11,
  author={Дачев, Кирил и Хезари, Хамид},
  title={Обратные задачи в спектральной геометрии},
  journal={Обратные проблемы и приложения: Inside Out II},
  volume={60},
  year={2011 год},
  pages={455--486}
}
}
@book{FBZ04,
 author={Френкель, Эдвард и Бен-Цви, Дэвид},
 title={Алгебры и алгебраические кривые},
 volume={(88)},
 publisher={Американский математический сок.},
 year={2004 год}
}
}
@online{TF17,
  author={Франке (Тобиас)},
  title={Тройной продукт\-выход inte\-grals},
  date={2023-09-01},
  url={https://www.tobias-franke.eu/log/2017/04/19/triple-products.html}
}
}
@article{CG93,
  author={Гордон (Кэролин)},
  title={Изоспектральные замкнутые риманнские многообразия, которые не являются локально изометрическими},
  journal={Журнал дифференциальной геометрии},
  volume={37},
  number={3},
  year={1993 год},
  pages={639--649}
}
}
@article{GK80,
  author={Гильмен, Виктор и Каждан, Давид},
  title={Некоторые обратные спектральные результаты для отрицательно изогнутых n-манифольдов},
  journal={Симпозиумы в чистой математике},
  volume={36},
  pages={301--312},
  year={1980}
}
}
@article{LH68,
  author={Хёрмандер (Ларс)},
  title={Спектральная функция эллиптического оператора},
  journal={Математические операторы прошлого и настоящего Фурье},
  publisher={Спрингер Берлин Гейдельберг},
  year={1968 год},
  pages={217--242}
}
}
@book{AK01,
  author={Кнапп, Энтони У},
  title={Теория представления полупростых групп: обзор на основе примеров},
  publisher={Пресс-центр Принстонского университета},
  year={2001 год}
}
}
@online{LS18,
  author={Лу, Цзяньфэн и Штайнербергер, Стефан},
  title={На точечных продуктах эллиптических собственных функций},
  archivePrefix={arXiv},
  eprint={1810.01024},
  year={2018 г.}
}
}
@article{JM64,
  author={Мильнор, Джон},
  title={Собственные ценности оператора Лапласа на определенных многообразиях},
  journal={Труды Национальной академии наук},
  volume={51},
  number={4},
  year={1964 год},
  pages={542--542}
}
}
@article{NRR22,
  author={Нильссон, Эрик и Роулетт, Джули и Райделл, Феликс},
  title={Изоспектральная проблема плоских тори с трех точек зрения},
  journal={Вестник Американского математического общества},
  volume={60},
  number={1},
  year={2023 г.},
  pages={39--83}
}
}
@book{RS75,
  author={Рид, Майкл и Саймон, Барри},
  title={Методы современной математической физики II: анализ Фурье, самосоединение},
  volume={2},
  publisher={Эльзевьер},
  year={1975 год}
}
}
@article{PS94,
  author={Сарнак (Питер)},
  title={Интегралы продуктов собственных функций},
  journal={ИМРТ},
  volume={6},
  year={1994 год},
  pages={251--260}
}
}
@phdthesis{AS94,
  author={Шиманн, Александр},
  title={Ternäre positiv определенный quad\-ratische Formen mit gleichen Дарстеллунгс\-зален},
  publisher={Боннер Матхе\матише Шрифтен},
  school={Боннский университет},
  volume={(268)},
  year={1993 год}
}
}
@article{TS85,
  author={Сунада, Тосикадзу},
  title={Риманнские покрытия и изоспектральные коллектора},
  journal={Анналы математики},
  volume={121},
  number={1},
  year={1985 год},
  pages={169--186}
}
}
@article{ST80,
  author={Танно (Шукити)},
  title={Характеристика канонических сфер по спектру},
  journal={Математика. З.},
  volume={175 год},
  number={3},
  year={1980},
  pages={267--274}
}
}
@book{MT13,
  author={Тейлор, Майкл},
  title={Частичные дифференциальные уравнения II: качественные исследования линейных уравнений},
  volume={(116)},
  publisher={Спрингер Наука \&amp; Бизнес Медиа},
  year={2013 г.}
}
}
@article{HW11,
  author={Вейль},
  title={Über die asymp\-totische Ver\-teilung der Eigen\-werte},
  journal={Nach\richten der König\-lichen Gesell\-schaft der Wissen\-schaften zu Гёттинген},
  year={1911 год},
  pages={110--117}
}
}
@article{EW22,
  author={Уайман (Эмметт)},
  title={Треугольники и тройные продукты собственных функций Лапласа},
  journal={Журнал функционального анализа},
  volum={282},
  number={8},
  year={2022 год},
  doi = {https://doi.org/10.1016/j.jfa.2022.109404}
}
}
@article{GZ97,
  author={Чжоу (Гэнцян)},
  title={Компактность изоспектральных компактных коллекторов с ограниченными кривизнами},
  journal={Тихий океан J. Математика},
  volume={181 год},
  number={1},
  year={1997},
  pages={187-200}
}
}
@online{AA25,
  author={Адве (Аньшуль)},
  title={Конверсная теорема для гиперболических поверхностных спектров и конформной бутстрап},
  archivePrefix={arXiv},
  eprint={2509.17935},
  year={2025 год},
  doi={https://doi.org/10.48550/arXiv.2509.17935}
}