@article{MS67,
  title={Курвитура и собственные величины лаплацианцев},
  Journal={Журнал дифференциальной геометрии},
  author={McKean, Генри П. and Singer, Isadore M.},
  том={1},
  число={1-2},
  страницы={43--69},
  год={1967},
  Издатель={Lehigh University}


@book{JC19,
  Автор={Conway, John B.},
  title={Курс функционального анализа},
  том={96},
  год={2019},
  издатель={Springer}


@article{CS92,
 Автор={Conway, John H and Sloane, N. J. A.},
 title={Четырехмерные решетки с той же тета серией},
 журнал={Internat. Математика Рес. Уведомления,
 том={4},
 год={1992},
 страницы={93--96}


@article{DH11,
  автор={Дачев, Кирилл и Хезари, Хамид}
  title={Обратные задачи в спектральной геометрии},
  journal={Инверсные проблемы и приложения: Inside Out II},
  том={60},
  год={2011},
  страницы={455--486}


@book{FBZ04,
 автор={Френкель, Эдвард и Бен-Цви, Давид},
 title={Вертексные алгебры и алгебраические кривые},
 том={88}
 Издатель={American Mathematical Soc.},
 год={2004}


@online{TF17,
  Автор={Franke, Tobias}
  title={Triple prod\-uct inte\grals},
  дата={2023-09-01},
  URL={https://www.tobias-franke.eu/log/2017/04/19/triple-products.html}


@article{CG93,
  автор={Гордон, Кэролин,
  title={Изоспектральные замкнутые риманские многообразия, которые не являются локально изометрическими},
  Journal={Журнал дифференциальной геометрии},
  том={37}
  число={3},
  год={1993},
  страницы={639--649}


@article{GK80,
  Автор={Гиллемин, Виктор и Каждан, Давид,
  title={Некоторые обратные спектральные результаты для отрицательно изогнутых n-manifolds},
  Journal={Труды симпозиумов в чистой математике},
  том={36},
  страницы={301--312},
  год={1980}


@article{LH68,
  Автор={H¶rmander, Lars},
  title={ спектральная функция эллиптического оператора},
  Journal={Математические интегральные операторы прошлого и настоящего Фурье},
  издатель={Springer Berlin Heidelberg},
  год={1968},
  страницы={217--242}


@book{AK01,
  Автор={Knapp, Энтони В},
  title={Теория представлений полупростых групп: обзор на основе примеров},
  издатель={Princeton University Press},
  год={2001}


@online{LS18,
  автор={Лу, Цзяньфэн и Штайнербергер, Стефан},
  title={На точечные продукты эллиптических собственных функций},
  archivePrefix={arXiv},
  eprint={1810.01024},
  год={2018}


@proceedings{JM64,
  Автор={Milnor, John},
  title={ Собственные значения оператора Лапласа на некоторых манифольдах},
  Journal={Труды Национальной академии наук},
  том={51},
  число={4},
  год={1964},
  страницы={542--542}


@article{NRR22,
  автор={Nilsson, Erik and Rowlett, Julie and Rydell, Felix}
  title={Изоспектральная проблема плоских тори с трех точек зрения},
  Журнал={Вестник Американского математического общества},
  том={60},
  число={1},
  год={2023},
  страницы={39--83}


@book{RS75,
  Автор={Reed, Michael and Simon, Barry}
  title={Методы современной математической физики II: Фурье-анализ, самосопряженность,
  том={2},
  издатель={Elsevier},
  год={1975}


@article{PS94,
  автор={Сарнак, Петр}
  title={Интегралы продуктов собственных функций},
  журнал={IMRN},
  том={6},
  год={1994},
  страницы={251--260}


@phdthesis{AS94,
  Автор={Схиманн, Александр,
  title={Ternäre positiv Определенный квад\-ratische Formen mit gleichen Darstellungs\-zahlen},
  Издатель={Bonner Mathe\matische Schriften},
  школа={Universität Bonn},
  том={268},
  год={1993}


@article{TS85,
  автор={Сунада, Тосикадзу},
  title={Риманские покрытия и изоспектральные манифольды},
  Journal={Анналы математики},
  том={121},
  число={1},
  год={1985},
  страницы={169--186}


@article{ST80,
  автор={Танно, Шукичи},
  title={Характеристика канонических сфер спектром,
  Журнал={Математика. З.
  том={175},
  номер={3},
  год={1980},
  страницы={267--274}


@book{MT13,
  Автор={Тейлор, Майкл}
  title={Частичные дифференциальные уравнения II: качественные исследования линейных уравнений,
  том={116},
  Издатель={Springer Science \&amp; Business Media},
  год={2013}


@article{HW11,
  автор={Вейл, Герман,
  title={Aber die asymp\-totische Ver\teilung der Eigen\-werte}
  Journal={Nach\richten der König\-lichen Gesell\-schaft der Wissen\-schaften zu Göttingen}
  год={1911},
  страницы={110--117}


@article{EW22,
  автор={Wyman, Emmett L},
  title={Треугольники и тройные продукты собственных функций Лапласа},
  Journal={Journal of Functional Analysis}
  volum={282},
  номер={8},
  год={2022},
  doi = {https://doi.org/10.1016/j.jfa.2022.109404}


@article{GZ97,
  Автор={Zhou, Gengqiang},
  title={Компактность изоспектральных компактных многообразий с ограниченными кривизнами},
  Журнал={Pacific J. математика,
  том={181},
  число={1},
  год={1997},
  страницы={187--200}
}
