@article{MS67,
  title={Кривизна и собственные величины лапласийского},
  journal={Журнал дифференциальной геометрии},
  author={McKean, Генри П. и Сингер, Исадор М.},
  volume={1},
  number={1-2},
  pages={43--69},
  year={1967 год},
  publisher={Университет Лихи}
}
}
@book{JC19,
  author={Конвей, Джон Б.},
  title={Курс функционального анализа},
  volume={96},
  year={2019 год},
  publisher={Спрингер}
}
}
@article{CS92,
 author={Конвей, Джон Х и Слоун, Н. Дж.},
 title={Четырехмерные решетки с той же тета-серией},
 journal={Интернат Математика Рес. Уведомления},
 volume={4},
 year={1992 год},
 pages={93--96}
}
}
@article{DH11,
  author={Дачев, Кирилл и Хезари, Хамид},
  title={Обратные задачи в спектральной геометрии},
  journal={Обратные задачи и приложения: Inside Out II},
  volume={60},
  year={2011 год},
  pages={455--486}
}
}
@book{FBZ04,
 author={Френкель, Эдвард и Бен-Цви, Дэвид},
 title={Алгебры вершин и алгебраические кривые},
 volume={88},
 publisher={Американская математика.},
 year={2004 год}
}
}
@online{TF17,
  author={Франке (Тобиас)},
  title={Тройной prod\-uct inte\grals},
  date={2023-09-01},
  url={https://www.tobias-franke.eu/log/2017/04/19/triple-products.html}
}
}
@article{CG93,
  author={Гордон (Кэролин)},
  title={Изоспектральные замкнутые римановые многообразия, которые не являются локально изометрическими},
  journal={Журнал дифференциальной геометрии},
  volume={37},
  number={3},
  year={1993 год},
  pages={639--649}
}
}
@article{GK80,
  author={Гильемен, Виктор и Каждан, Давид},
  title={Некоторые обратные спектральные результаты для отрицательно изогнутых n-многообразов},
  journal={Материалы симпозиумов в чистой математике},
  volume={36},
  pages={301--312},
  year={1980 год}
}
}
@article{LH68,
  author={Хёрмандер},
  title={спектральная функция эллиптического оператора},
  journal={Математические интегральные операторы прошлого и настоящего Фурье},
  publisher={Спрингер Берлин Гейдельберг},
  year={1968 год},
  pages={217--242}
}
}
@book{AK01,
  author={Кнапп, Энтони У},
  title={Теория представления полупростых групп: обзор на основе примеров},
  publisher={Принстонский университет},
  year={2001 год}
}
}
@online{LS18,
  author={Лу, Цзяньфэн и Штайнербергер, Стефан},
  title={На точечных продуктах эллиптических собственных функций},
  archivePrefix={arXiv},
  eprint={1810.01024},
  year={2018 год}
}
}
@proceedings{JM64,
  author={Милнор, Джон},
  title={Собственные значения оператора Лапласа на некоторых многообразиях},
  journal={Труды Национальной академии наук},
  volume={51},
  number={4},
  year={1964 год},
  pages={542--542}
}
}
@article{NRR22,
  author={Нильссон, Эрик и Роулетт, Джули и Райделл, Феликс},
  title={Изоспектральная проблема плоских тори с трех точек зрения},
  journal={Вестник Американского математического общества},
  volume={60},
  number={1},
  year={2023 год},
  pages={39--83}
}
}
@book{RS75,
  author={Рид, Майкл и Саймон, Барри},
  title={Методы современной математической физики II: Фурье-анализ, самосопряженность},
  volume={2},
  publisher={Эльзевьер},
  year={1975 год}
}
}
@article{PS94,
  author={Сарнак},
  title={Интегралы продуктов собственных функций},
  journal={IMRN},
  volume={6},
  year={1994 год},
  pages={251--260}
}
}
@phdthesis{AS94,
  author={Шиман, Александр},
  title={Ternäre positiv четвёртый\-ratische Formen mit gleichen Darstellungs\-zahlen},
  publisher={Боннер Мате\matische Schriften},
  school={Университет Бонн},
  volume={(268)},
  year={1993 год}
}
}
@article{TS85,
  author={Сунада},
  title={Римановые покрытия и изоспектральные манифольды},
  journal={Анналы математики},
  volume={121},
  number={1},
  year={1985 год},
  pages={169-186}
}
}
@article{ST80,
  author={Танно},
  title={Характеристика канонических сфер по спектру},
  journal={Математика З.},
  volume={(175)},
  number={3},
  year={1980 год},
  pages={267--274}
}
}
@book{MT13,
  author={Тейлор, Майкл},
  title={Частичные дифференциальные уравнения II: качественные исследования линейных уравнений},
  volume={116},
  publisher={Springer Science \&amp; Бизнес Медиа},
  year={2013 год}
}
}
@article{HW11,
  author={Вейль},
  title={Uber умереть asymp\-totische Ver\-teilung der Eigen\-werte},
  journal={Nach\richten der König\-lichen Gesell\-schaft der Wissen\-schaften zu Геттинген},
  year={1911 год},
  pages={110--117}
}
}
@article{EW22,
  author={Уайман, Эмметт Л},
  title={Треугольники и тройные продукты собственных функций Лапласа},
  journal={Журнал функционального анализа},
  volum={(282)},
  number={8},
  year={2022 год},
  doi = {https://doi.org/10.1016/j.jfa.2022.109404}
}
}
@article{GZ97,
  author={Чжоу (Гэнцян)},
  title={Компактность изоспектральных компактных коллекторов с ограниченными кривизнами},
  journal={Пасифик Дж. Математика},
  volume={(181)},
  number={1},
  year={1997 год},
  pages={187-200}
}
