---
archived: ~
categories: ~
dependencies: '*.md.ru'
keywords: коммунизм, historic.ly
published: ~
status: черновик
title: 2025 Личная записка
---

Я редко пишу личные сообщения, потому что считаю их трудными и не относящимися к работе. Но {# lede #}Я должен объяснить свое долгое отсутствие в этом году и поблагодарить всех, кто продолжал поддерживать этот проект.{# lede #}.

Этот год был очень трудным, и это самый трудный пост в блоге, который я когда-либо писал.

13 июня умер мой любимый дядя Шехар. Он был не просто моим дядей – люди привыкли шутить о том, насколько мы близки. Люди шутят, что я его старшая дочь. Я был опустошен. Но если бы это была смерть моего дяди, я бы не был дисфункциональным.

Мой дядя с женой

<center>

![дядя и жена](2025-a-personal-note.page/esha-and-uncle).

</center>

На следующий день мужчина, который был моим партнером в течение последних двух лет, решил съесть кого-то другого вместо того, чтобы оставаться и утешать меня. Когда я быстро пытался попасть на похороны моего дяди, он пропал. Я сел на самолет. Когда я приземлился, у меня был большой сюрприз. Как только я вытащил свой телефон из режима самолета, я получил порнографическое видео от другой женщины. Я был в аэропорту, и я не знал, как это сделать. Так что я сделал то, что, естественно, сделал, когда у меня была проблема, которую я не мог решить, и попытался позвонить моему любимому дяде Шехару. Но на этот раз, только чтобы понять, что он ушел.

Человек, которого я думал, что люблю, и которого я ошибочно верил, любил меня, показал мне меньше сострадания, чем случайные незнакомцы. Бортпроводник на Finnair увидел мое скорбящее лицо и перевел меня в бизнес-класс, чтобы я мог плакать в частном порядке. Чтобы добавить оскорбление к травме, другая женщина, как будто танцевать на могиле моего дяди, послала мне чрезвычайно отвратительные сообщения ([Нажмите здесь, чтобы прочитать, я бы предпочел не пережить это](https://x.com/eshaLegal/status/1954670433904492945?s=20)).

Эта двойная травма и предательство сильно ударили меня. Я не мог опечалиться за своего дядю, потому что каждый раз, когда я пытался, другое предательство вторгалось в мои воспоминания. Я не мог писать, исследовать или выполнять другие задачи, которые сделали возможным Historic.ly.

Через некоторое время мне удалось получить лечение ПТСР и психологически улучшить достаточно, чтобы быть функциональным. Я решил переосмыслить травму как последний подарок от моего дяди с небес, показав мне истинную природу человека, который явно недостойен. У меня так много хороших воспоминаний о моем дяде, как время, когда он отвез меня в Диснейленд.

Для тех из вас, кто остался в качестве платных подписчиков в течение этого времени, нет слов, чтобы поблагодарить вас.

Для тех из вас, кто решил отказаться от подписки, я хотел бы извиниться. Мне очень жаль. Я подвел тебя. Для этого у меня нет оправданий, и я стремлюсь восстановить ваше доверие. Я надеюсь, что вы передумаете и снова станете подписчиком.

Я надеюсь, что за последнюю неделю или две я восполнил отсутствие контента. Я намереваюсь продолжить 2026 год, и моя серия по каждому антикоммунистическому вопросу развенчалась:

Антикоммунистические разговоры развенчаны
Жертвы коммунизма – комедия в творчестве
Эша
·
14 декабря 2025 г.
Жертвы коммунизма – комедия в творчестве

<center>

![дядя и жена](2025-a-personal-note.page/victims-of-communism).

</center>

Редактор: Прошу прощения за долгое отсутствие. Я имел дело с чрезвычайно травмирующими личными проблемами, которые включали смерть моего дяди. Я благодарю вас за ваше терпение и продолжающееся доверие исторически.

Читать полностью
Я также хотел бы закончить свой сериал о Ноаме Хомском, который давно идет.

К счастью, я, наконец, смог получить свое доменное имя historic.ly, и я буду передавать сайт с большим содержанием в течение первых нескольких недель января.

Я также надеюсь закончить свою книгу, над которой я работал последние несколько лет: «Народная история Советского Союза».

Самое главное, желаю всем счастливого нового года.
<!-- $Date$ $Author$ $Revision$ -->
