---
archived: ~
categories: ~
keywords: ~
published: ~
status: черновик
title: Состоит из всех...
---

Имейте в виду, что большая часть существующего сообщества пользователей развертывает mod_apreq2 в кластере среднего уровня за шлюзами HTTPS, поэтому статистика, представленная <https://webtechsurvey.com/technology/mod_apreq2>, представляет собой лишь часть общей базы развернутых пользователей.

<!-- $Date: 2024-04-24 01:28:11 +0000 (Wed, 24 Apr 2024) $ $Author: joe $ -->

<!-- $Date: 2024-04-24 01:28:11 +0000 (Wed, 24 Apr 2024) $ $Author: joe $ $Revision: 23809 $ -->
