---
categories: ~
keywords: ~
status: черновик
title: Состоящий из всех...
---

Имейте в виду, что большая часть существующего сообщества пользователей развертывает mod_apreq2 в среднеуровневом кластере за шлюзами HTTPS, поэтому статистика по <https://webtechsurvey.com/technology/mod_apreq2> составляют лишь часть от общей развернутой базы пользователей.

Вперед к 2026 году, и вы можете увидеть, что усыновление снова на подъеме, несмотря на все усилия Апача убить Апрек в своей кроватке.

<!-- $Date$ $Author$ $Revision$ -->
