---
archived: ~
categories: ~
dependencies: '*.md.ru'
keywords: Фауси, Лабораторная утечка, Covid, суперпрессадер
published: ~
status: черновик
title: Была ли конференция летучих мышей, финансируемая Fauci, первым событием 2019
  года?
---

## Летучие мыши – социальные млекопитающие, как и мы, люди

Линфа и Дани покинули Ухань в конце ноября на сингапурской конференции в начале декабря 2019 года. Они встретились с Ши в их кампусе Дюка Сингапура с его лабораторией летучих мышей BSL3 и все зашли в такси, чтобы быстро добраться до конференц-центра за 10 минут.

К декабрю 2019 года заразная вакцина летучей мыши, которая вскоре будет переименована в SARS2, уже распространилась за пределы Ухана. Поскольку не было ПЦР-теста, и они даже не знали, что это такое, Дани, Линфа и Ши продолжили свою профессиональную жизнь. Это была большая международная конференция летучих мышей для «малой группы» специализированных вирусологов летучих мышей.

Дани утверждал, что «не было болтовни», но Сингапур, вероятно, был нулевым для распространения пневмонии в Ухане. По мере распространения неназванного вируса, «неизвестного присутствующим ученым», некоторые начали распространять слухи.

В исследовательской работе по трансмиссивной вакцине, финансируемой NIH в 2019 году, говорилось о таких событиях, как этот. «Человеками, которые, скорее всего, распространят болезнь (т.е. суперраспространение)» в небольшом, плотном международном сообществе вирусологии, являются Ши, Линфа и Дани. Они являются «высокосвязанными узлами» и будут социализироваться, как летучие мыши млекопитающих, начиная «процесс вакцинации «знакомств» случайным образом выбранных людей».

## Партия «Прибыль-Функция» 2019 года

Вирусологи, присутствовавшие на конференции в Сингапуре в декабре 2019 года, были в восторге. Они вернулись в бизнес Gain-of-Function в течение двух лет, поэтому пришло время обсудить их последние продукты вакцины для животных.

Исследование Gain-of-Function (GoF) никогда не останавливалось, так как анонимный давний чиновник NIH сказал: «Если вы запрещаете исследование GoF, вы запрещаете всю вирусологию». Он добавил: «С момента моратория (2014) все ушли в прошлое и только что провели исследование GoF в любом случае». Fauci в начале 2019 года сказал, что это было разумное решение официально возобновить исследование.

NIH Фаучи снял паузу GoF за неделю до Рождества 2017 года, когда все покидали Вашингтон. 50-летний чиновник знал, как использовать изменения в администрации президента. Это был период без лидера, когда секретарь HHS (руководитель NIH, FDA, CDC) ушел в отставку в сентябре 2017 года, но до того, как его замена была подтверждена и приведена к присяге в январе 2018 года. Фаучи даже обсуждал музыкальные стулья HHS (2:00). Это произошло в течение двух лет без директора ОСТП в Белом доме.

<!-- $Date$ $Author$ $Revision$ -->
