---
categories: ~
keywords: ~
status: черновик
title: Ссылки
---

#### Опубликовано в [SSRN](https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4793533) 16 апреля 2024 г.

- [PDF](triple-products.pdf.en)

- [$$\LaTeX$$](triple-products.tex.en)

- [$$\LaTeX$$ Библиография](triple-products.bbl.en) как [ДЖСОН](triple-products.page/bibliography.json.en)

#### Опубликовано в [arXiv](https://arxiv.org/abs/2406.12868) 21 июня 2024 г.

#### [Отклонено из JST](triple-products.page/jst-review.txt) на 15 сентября 2024 г.

#### Переработан и отправлен повторно в SSRN 26 сентября 2024 г.

#### Обзор Фейсбука [Джо Кокс](triple-products.page/joe-cox.txt) 5 октября 2024 г.

#### Оригинальное название: Anshul Adve <https://arxiv.org/abs/2509.17935> на 22 сентября 2025 г.

Уникальность в работе Аншула в значительной степени зависит от методов, описанных в моей статье.  Очень хорошо сделано!

#### Переработано и повторно отправлено в SSRN 20 октября 2025 г.

#### Обсуждение гипотезы расширилось за счет включения общего случая. Повторно отправлено в SSRN и arXiv 18 февраля 2026 г.

#### Эскиз доказательства гипотезы, намеченный на 15 июля 2026 года

#### Гипотеза реорганизована в пару Короллариев 16 июля 2026 года

#### Опубликовано в SSRN и arXiv 27 июля 2026 г.

<!-- $Date$ $Author$ $Revision$ -->
