---
archived: ~
categories: ~
keywords: ~
published: ~
status: черновик
title: Ссылки
---

#### Опубликовано в [SSRN](https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4793533) 16 апреля 2024 г.

- [PDF](triple-products.pdf.en).

- [$$\LaTeX$$](triple-products.tex.en).

- [$$\LaTeX$$ Библиография](triple-products.bbl.en) как [ИСОН](triple-products.page/bibliography.json.en).

#### Опубликовано в [arXiv](https://arxiv.org/abs/2406.12868) 21 июня 2024 г.

#### [Отклонено из JST](triple-products.page/jst-review.txt) 15 сентября 2024 г.

#### переработано и повторно отправлено в SSRN 26 сентября 2024 г.

#### Обзор Фейсбука по [Джо Кокс](triple-products.page/joe-cox.txt) 5 октября 2024

#### Первое цитирование по Anshul Adve <https://arxiv.org/abs/2509.17935> 22 сентября 2025 г.

Уникальность результатов в статье Аншула в значительной степени зависит от методов, описанных в моей статье.  Очень хорошо сделано!

Весь генезис Обратных Проблем в Спектральной Теории происходит от Марка Кака «Можете ли вы услышать форму барабана?»

Введение моей статьи описывает состояние искусства с 1997 года. Понятно, что только спектр Лапласа неадекватен.  Тем не менее, дополнение его тройными интегралами продуктов имеет много обещаний с точки зрения описания карты. $$(M,g) \mapsto \set{\lambda_i, M^{i,j,k}}$$.

Мы должны понять изображение этой карты, прежде чем мы сможем описать ее обратную.

Работа Аншула над теорией кокомпактного представления касательных пачек единиц $$PSL(2,\Reals)$$ Выполняет оба и освещает первоначальный путь вперед.

#### Переработано и повторно отправлено в SSRN 18 октября 2025 г.

<!-- $Date$ $Author$ $Revision$ -->
